var jsonData = {'xData': [0.246, 0.296, 0.346, 0.396, 0.446, 0.496, 0.546, 0.596, 0.646, 0.696, 0.746, 0.796, 0.846, 0.896, 0.946, 0.996, 1.046, 1.096, 1.146, 1.196, 1.246, 1.296, 1.346, 1.396, 1.446, 1.496, 1.546, 1.596, 1.646, 1.696, 1.746, 1.796, 1.846, 1.896, 1.946, 1.996, 2.046, 2.096, 2.146, 2.196, 2.246, 2.296, 2.346, 2.396, 2.446, 2.496, 2.546, 2.596, 2.646, 2.696, 2.746, 2.796, 2.846, 2.896, 2.946, 2.996, 3.046, 3.096, 3.146, 3.196, 3.246, 3.296, 3.346, 3.396, 3.446, 3.496, 3.546, 3.596, 3.646, 3.696, 3.746, 3.796, 3.846, 3.896, 3.946, 3.996, 4.046, 4.096, 4.146, 4.196, 4.246, 4.296, 4.346, 4.396, 4.446, 4.496, 4.546, 4.596, 4.646, 4.696, 4.746, 4.796, 4.846, 4.896, 4.946, 4.996, 5.046, 5.096, 5.146, 5.196, 5.246, 5.296, 5.346, 5.396, 5.446, 5.496, 5.546, 5.596, 5.646, 5.696, 5.746, 5.796, 5.846, 5.896, 5.946, 5.996, 6.046, 6.096, 6.146, 6.196, 6.246, 6.296, 6.346, 6.396, 6.446, 6.496, 6.546, 6.596, 6.646, 6.696, 6.746, 6.796, 6.846, 6.896, 6.946, 6.996, 7.046, 7.096, 7.146, 7.196, 7.246, 7.296, 7.346, 7.396, 7.446, 7.496, 7.546, 7.596, 7.646, 7.696, 7.746, 7.796, 7.846, 7.896, 7.946, 7.996, 8.046, 8.096, 8.146, 8.196, 8.246, 8.296, 8.346, 8.396, 8.446, 8.496, 8.546, 8.596, 8.646, 8.696, 8.746, 8.796, 8.846, 8.896, 8.946, 8.996, 9.046, 9.096, 9.146, 9.196, 9.246, 9.296, 9.346, 9.396, 9.446, 9.496, 9.546, 9.596, 9.646, 9.696, 9.746, 9.796, 9.846, 9.896, 9.946, 9.996, 10.046, 10.096, 10.146, 10.196, 10.246, 10.296, 10.346, 10.396, 10.446, 10.496, 10.546, 10.596, 10.646, 10.696, 10.746, 10.796, 10.846, 10.896, 10.946, 10.996, 11.046, 11.096, 11.146, 11.196, 11.246, 11.296, 11.346, 11.396, 11.446, 11.496, 11.546, 11.596, 11.646, 11.696, 11.746, 11.796, 11.846, 11.896, 11.946, 11.996, 12.046, 12.096, 12.146, 12.196, 12.246, 12.296, 12.346, 12.396, 12.446, 12.496, 12.546, 12.596, 12.646, 12.696, 12.746, 12.796, 12.846, 12.896, 12.946, 12.996, 13.046, 13.096, 13.146, 13.196, 13.246, 13.296, 13.346, 13.396, 13.446, 13.496, 13.546, 13.596, 13.646, 13.696, 13.746, 13.796, 13.846, 13.896, 13.946, 13.996, 14.046, 14.096, 14.146, 14.196, 14.246, 14.296, 14.346, 14.396, 14.446, 14.496, 14.546, 14.596, 14.646, 14.696, 14.746, 14.796, 14.846, 14.896, 14.946, 14.996, 15.046, 15.096, 15.146, 15.196, 15.246, 15.296, 15.346, 15.396, 15.446], 'datasets': [{'name': '', 'data': [37.6, 38.6, 38.2, 39.4, 38.6, 39.2, 39.2, 40.2, 40.8, 41.0, 40.6, 39.2, 37.4, 37.2, 37.6, 36.0, 36.0, 35.6, 34.0, 34.2, 33.8, 34.2, 34.6, 34.8, 34.8, 36.4, 36.8, 36.8, 36.6, 35.4, 35.6, 36.2, 36.0, 34.6, 33.4, 32.4, 31.2, 30.2, 32.0, 33.0, 33.2, 34.8, 35.2, 35.4, 36.8, 37.8, 39.6, 40.6, 39.6, 39.6, 39.2, 37.6, 37.4, 38.4, 37.4, 36.6, 37.0, 37.6, 36.8, 38.0, 39.4, 41.2, 42.8, 42.8, 44.2, 45.2, 43.8, 43.2, 43.8, 43.0, 44.2, 42.6, 41.6, 41.4, 40.8, 40.2, 40.6, 40.8, 40.8, 41.0, 39.8, 39.6, 39.6, 40.6, 41.8, 41.4, 41.4, 41.6, 42.4, 43.0, 41.2, 41.4, 41.4, 40.2, 39.2, 38.0, 37.0, 36.6, 36.0, 35.6, 36.8, 36.6, 36.8, 37.6, 37.8, 38.6, 40.4, 41.8, 42.0, 41.0, 41.0, 41.6, 40.6, 39.8, 39.4, 39.6, 38.2, 36.4, 37.6, 38.0, 38.8, 40.2, 39.6, 41.0, 40.6, 41.8, 42.8, 43.4, 41.8, 41.2, 42.2, 40.6, 43.0, 42.4, 43.0, 42.8, 42.8, 43.0, 43.4, 43.8, 41.6, 43.4, 42.2, 41.4, 41.2, 41.6, 41.2, 39.4, 39.6, 40.2, 41.6, 40.2, 39.4, 39.8, 41.2, 40.8, 42.0, 44.2, 44.0, 43.8, 42.8, 42.6, 43.2, 43.2, 42.6, 42.8, 41.4, 40.6, 40.8, 40.4, 40.6, 40.0, 40.8, 41.4, 40.0, 39.6, 38.8, 39.0, 38.4, 39.2, 39.2, 40.0, 38.8, 37.8, 38.0, 38.6, 40.0, 39.2, 39.6, 39.2, 38.8, 38.6, 39.2, 38.8, 39.2, 38.6, 38.8, 39.0, 38.6, 39.0, 39.6, 39.6, 40.4, 40.8, 41.2, 40.6, 39.2, 39.6, 40.0, 39.2, 37.8, 36.6, 36.4, 36.6, 37.6, 38.4, 39.2, 38.4, 38.6, 38.2, 39.4, 40.0, 40.2, 40.6, 39.2, 40.2, 40.6, 42.0, 41.2, 41.4, 41.6, 44.0, 43.4, 43.2, 43.0, 41.6, 40.4, 39.6, 41.8, 44.8, 43.6, 42.0, 41.8, 42.2, 43.0, 43.6, 44.4, 44.8, 42.2, 39.0, 40.0, 39.4, 39.6, 39.2, 38.0, 37.8, 37.8, 38.0, 37.8, 38.0, 37.8, 38.4, 38.2, 37.8, 39.4, 39.2, 39.6, 39.6, 40.4, 41.8, 42.0, 43.0, 43.0, 43.4, 41.6, 41.0, 41.4, 41.2, 41.6, 40.8, 40.6, 38.4, 38.4, 37.4, 36.8, 36.2, 34.2, 33.4, 30.8, 29.4, 29.2, 29.4, 28.2, 28.4, 29.8, 31.4, 33.4, 34.0, 35.8, 37.2, 37.8, 38.4, 38.8, 39.8, 39.6], 'unit': '%', 'type': 'line', 'valueDecimals': 1}]};
let container = document.getElementById('gcmap'),
  highlightPoint = function(e) {
    var chart,
      point,
      i,
      event;
    for (i = 0; i < Highcharts.charts.length; i = i + 1) {
      chart = Highcharts.charts[i];
      // Find coordinates within the chart
      event = chart.pointer.normalize(e);
      // Get the hovered point
      point = chart.series[0].searchPoint(event, true);
      if (point) {
        point.highlight(e);
      }
    }
  };
['mousemove', 'touchmove', 'touchstart'].forEach(function (eventType) {
  container.addEventListener(
    eventType,
    function (e) {
      highlightPoint(e);
    }
  );
});
/**
 * 重写内部的方法， 这里是将提示框即十字准星的隐藏函数关闭
 */
Highcharts.Pointer.prototype.reset = function () {
  return undefined;
};
/**
 * 高亮当前的数据点，并设置鼠标滑动状态及绘制十字准星线
 */
Highcharts.Point.prototype.highlight = function (event) {
  this.onMouseOver(); // 显示鼠标激活标识
  this.series.chart.tooltip.refresh(this); // 显示提示框
  this.series.chart.xAxis[0].drawCrosshair(event, this); // 显示十字准星线
};
/**
 * 同步缩放效果，即当一个图表进行了缩放效果，其他图表也进行缩放
 */
function syncExtremes(e) {
  var thisChart = this.chart;
  if (e.trigger !== 'syncExtremes') { 
    Highcharts.each(Highcharts.charts, function (chart) {
      if (chart !== thisChart) {
        if (chart.xAxis[0].setExtremes) { 
          chart.xAxis[0].setExtremes(e.min, e.max, undefined, false, { trigger: 'syncExtremes' });
        }
      }
    });
  }
}
// 使用定义的JSON数据
var activity = jsonData;

activity.datasets.forEach(function (dataset, i) {
  // Add X values
  dataset.data = Highcharts.map(dataset.data, function (val, j) {
    return [activity.xData[j], val];
  });
  var chartDiv = document.createElement('div');
  chartDiv.className = 'chart';
  container.appendChild(chartDiv);
  Highcharts.chart(chartDiv, {
    chart: {
      width: 990,
      height: 200,
      marginLeft: 45, // Keep all charts left aligned
      spacingTop: 20,
      spacingBottom: 20
    },
    title: {
      text: dataset.name,
      align: 'left',
      margin: 0,
      x: 30
    },
    credits: {
      enabled: false
    },
    legend: {
      enabled: false
    },
    xAxis: {
      crosshair: true,
      events: {
        setExtremes: syncExtremes
      },
      labels: {
        format: '{value} k'
      }
    },
    yAxis: {
      title: {
        text: null
      }
    },
    tooltip: {
      positioner: function () {
        return {
          // right aligned
          x: this.chart.chartWidth - this.label.width,
          y: 10 // align to title
        };
      },
      borderWidth: 0,
      backgroundColor: 'none',
      pointFormat: '{point.y}',
      headerFormat: '',
      shadow: false,
      style: {
        fontSize: '12px'
      },
      valueDecimals: dataset.valueDecimals
    },
    series: [{
      data: dataset.data,
      name: dataset.name,
      type: dataset.type,
      lineWidth:1,
      color: Highcharts.getOptions().colors[i],
      fillOpacity: 0.3,
      tooltip: {
        valueSuffix: ' ' + dataset.unit
      }
    }]
  });
});
